missão 3/TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,945)
      - go(https://blazedemo.com/)
      - waitForByName(fromPort,Clickable): 10s
      - clickByName(fromPort)
      - waitForByName(fromPort,Clickable): 10s
      - selectByName(fromPort): "São Paolo"
      - waitForByName(toPort,Clickable): 10s
      - clickByName(toPort)
      - waitForByName(toPort,Clickable): 10s
      - selectByName(toPort): "New York"
      - waitForByCSS(input.btn.btn-primary,Clickable): 10s
      - clickByCSS(input.btn.btn-primary)
      - 'waitForByCSS(tr:nth-of-type(4) .btn,Clickable)': 10s
      - 'clickByCSS(tr:nth-of-type(4) .btn)'
      - waitForByID(inputName,Clickable): 10s
      - clickByID(inputName)
      - waitForByID(inputName,Clickable): 10s
      - typeByID(inputName): "Guilherme Teste"
      - waitForByID(address,Clickable): 10s
      - typeByID(address): "Rua teste 123"
      - waitForByID(city,Clickable): 10s
      - typeByID(city): "Taboão da serra"
      - waitForByID(state,Clickable): 10s
      - typeByID(state): "SP"
      - waitForByID(zipCode,Clickable): 10s
      - typeByID(zipCode): "124824-1247"
      - waitForByID(cardType,Clickable): 10s
      - clickByID(cardType)
      - waitForByID(cardType,Clickable): 10s
      - selectByID(cardType): "American Express"
      - waitForByID(creditCardNumber,Clickable): 10s
      - clickByID(creditCardNumber)
      - waitForByID(creditCardNumber,Clickable): 10s
      - typeByID(creditCardNumber): "149816281494201"
      - waitForByID(creditCardMonth,Clickable): 10s
      - clickByID(creditCardMonth)
      - waitForByID(creditCardMonth,Clickable): 10s
      - typeByID(creditCardMonth): "10"
      - waitForByID(creditCardYear,Clickable): 10s
      - clickByID(creditCardYear)
      - waitForByID(creditCardYear,Clickable): 10s
      - typeByID(creditCardYear): "2025"
      - waitForByID(nameOnCard,Clickable): 10s
      - typeByID(nameOnCard): "Guilherme Cavalcante Teste"
      - waitForByCSS(input.btn.btn-primary,Clickable): 10s
      - clickByCSS(input.btn.btn-primary)

  TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="135", "Not-A.Brand";v="8", "Chromium";v="135"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Content-Type: application/x-www-form-urlencoded
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/135.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      sec-ch-ua-arch: '"x86"'
      sec-ch-ua-platform-version: '"19.0.0"'
      sec-ch-ua-model: '""'
      sec-ch-ua-bitness: '"64"'
      sec-ch-ua-wow64: '?0'
      sec-ch-ua-full-version-list: >-
        "Google Chrome";v="135.0.7049.41", "Not-A.Brand";v="8.0.0.0",
        "Chromium";v="135.0.7049.41"
      Sec-Fetch-Site: same-origin
      Sec-Fetch-Mode: navigate
      Sec-Fetch-User: '?1'
      Sec-Fetch-Dest: document
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 0ms
            headers: {}
            body:
              fromPort: São Paolo
              toPort: New York
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 5452ms
            headers: {}
            body:
              airline: Virgin America
              flight: '12'
              fromPort: São Paolo
              price: '765.32'
              toPort: New York
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 59126ms
            headers: {}
            body:
              _token: ''
              address: Rua teste 123
              cardType: amex
              city: Taboão da serra
              creditCardMonth: '10'
              creditCardNumber: '149816281494201'
              creditCardYear: '2025'
              inputName: Guilherme Teste
              nameOnCard: Guilherme Cavalcante Teste
              state: SP
              zipCode: 124824-1247